-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 01, 2023 at 06:32 PM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.0.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `mydb`
--

-- --------------------------------------------------------

--
-- Table structure for table `sci_cs`
--

CREATE TABLE `sci_cs` (
  `cs_id` int(11) NOT NULL,
  `cs_name` varchar(100) NOT NULL,
  `cs_img` varchar(100) NOT NULL,
  `cs_date` varchar(40) NOT NULL,
  `cs_wallet` varchar(50) NOT NULL,
  `cs_range_date` varchar(400) NOT NULL,
  `cs_fcourse` varchar(400) NOT NULL,
  `cs_time` varchar(45) NOT NULL,
  `cs_location` varchar(50) NOT NULL,
  `cs_group` varchar(400) NOT NULL,
  `cs_detail` varchar(400) NOT NULL,
  `cs_perform` varchar(400) NOT NULL,
  `cs_reward` varchar(400) NOT NULL,
  `cs_schedule` varchar(400) NOT NULL,
  `cs_phone` char(10) DEFAULT NULL,
  `cs_year` char(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `sci_cs`
--

INSERT INTO `sci_cs` (`cs_id`, `cs_name`, `cs_img`, `cs_date`, `cs_wallet`, `cs_range_date`, `cs_fcourse`, `cs_time`, `cs_location`, `cs_group`, `cs_detail`, `cs_perform`, `cs_reward`, `cs_schedule`, `cs_phone`, `cs_year`) VALUES
(2, 'การอบรมเชิงปฏิบัติการการจัดการเรียนรู้วิทยาศาสตร์ตามแนวคิด Constructivism', 'images/02.png', '2023-07-09', '1,000 ', '9-10 ก.ค. 65', 'เพื่อพัฒนาการจัดการเรียนรู้วิทยาศาสตร์ตามแนวคิด Constructivism ของครูวิทยาศาสตร์', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'ครูวิทยาศาสตร์ตามตามบันทึกข้อตกลงความร่วมมือทางวิชาการ จำนวน 30 คน/รุ่นเป็นการส่งเสริมการพัฒนาการจัดการเรียนรู้วิทยาศาสตร์ตามแนวคิด Constructivism ของครูวิทยาศาสตร์', 'ความรู้เกี่ยวกับ แนวคิด Constructivism สำหรับครูวิทยาศาสตร์การออกแบบแผนการจัดการเรียนรู้ตามแนวคิด Constructivismการวัดและประเมินผลตามแนวคิด Constructivism', 'สิ่งที่ต้องประเมินครูมีความพึงพอใจวิธีการประเมินแบบประเมินความพึงพอใจ', 'ครูมีความสามารถในการจัดการเรียนรู้วิทยาศาสตร์ได้ดีขึ้น นักเรียนได้รับการพัฒนาให้มีผลการเรียนรู้ทางวิทยาศาสตร์เพิ่มขึ้น', 'pdf/02.pdf', '0639571567', '2023'),
(3, 'เวชสำอางสมุนไพร', 'images/03.png', '2023-06-24', '500 ', '24 มิ.ย. 65', 'เพื่อถ่ายทอดความรู้และความเข้าใจเกี่ยวกับสมุนไพรและสารพฤกษเคมี สามาถนำไปประยุกต์ใช้\r\nเพื่อเสริมสร้างความรู้เกี่ยวกับการทำเครื่องสำอางเบื้องต้น และได้แนวคิดในการพัฒนาต่อยอดเครื่องสำอางสมุนไพร', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nประชาชนที่สนใจ จำนวน 50 คน ต่อรุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการพัฒนาความรู้และความเข้าใจเกี่ยวกับสมุนไพรและสารพฤกษเคมี สามาถนำไปประยุกต์ใช้ และความรู้เกี่ยวกับการทำเครื่องสำอางเบื้องต้น และได้แนวคิดในการพัฒนาต่อยอดเครื่องสำอางสมุนไพร', 'สมุนไพรและรูปแบบการนำมาใช้ในการผลิตเวชสำอาง\r\nการสกัดสารสำคัญจากสมุนไพรด้วยวิธีต่างๆ\r\nธุรกิจเครื่องสำอางสมุนไพร\r\nการตรวจสอบคุณภาพผลิตภัณฑ์เครื่องสำอาง', 'สิ่งที่ต้องประเมิน\r\nความพึงพอใจ\r\nวิธีการประเมิน\r\nแบบประเมินความพึงพอใจ', 'ผู้เข้าอบรมมีความรู้และความเข้าใจเกี่ยวกับสมุนไพรและสารพฤกษเคมี สามาถนำไปประยุกต์ใช้ได้ \r\nผู้เข้าอบรมมีความรู้เกี่ยวกับการทำเครื่องสำอางเบื้องต้น และได้แนวคิดในการพัฒนาต่อยอดเครื่องสำอางสมุนไพร', 'pdf/03.pdf', '0895476319', '2023'),
(4, 'อบรมเชิงปฏิบัติการโปรแกรมสำเร็จรูปสำหรับการวิจัยและวัดผลการศึกษา', 'images/04.png', '2023-07-30', '3,000 ', '30-31 ก.ค. 65', 'เพื่อศึกษาความรู้พื้นฐานเกี่ยวกับการใช้คอมพิวเตอร์ ประเภทและลักษณะของโปรแกรมสำเร็จรูปกระบวนการทำงานของโปรแกรมสำเร็จรูปเพื่อการวิจัยและวัดผลการศึกษา การสร้างแฟ้มข้อมูล (Data File) และแฟ้มคำสั่ง ฝึกปฏิบัติการวิเคราะห์ข้อมูลลักษณะต่างๆ โดยใช้โปรแกรม SPSS for window  ได้แก่ สถิติพื้นฐาน การทดสอบ t-test และ ANOVA', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nบุคคลทั่วไปที่สนใจ จำนวน 30 คน ต่อรุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการพัฒนาความรู้พื้นฐานเกี่ยวกับการใช้คอมพิวเตอร์ ประเภทและลักษณะของโปรแกรมสำเร็จรูปกระบวนการทำงานของโปรแกรมสำเร็จรูปเพื่อการวิจัยและวัดผลการศึกษา การสร้างแฟ้มข้อมูล (Data File) และแฟ้มคำสั่ง ฝึกปฏิบัติการวิเคราะห์ข้อมูลลักษณะต่างๆ โดยใช้โปรแกรม SPSS for window  ได้แก่ สถิติพื้นฐาน การทดสอบ t-test และ ANOVA', 'ลักษณะและการทำงานของโปรแกรม SPSS for window \r\nการสร้างแฟ้มข้อมูล (Data File) และแฟ้มคำสั่ง\r\nการวิเคราะห์สถิติเชิงบรรยาย\r\nการเปรียบเทียบค่าเฉลี่ยของตัวอย่าง 2 กลุ่ม โดยใช้สถิติทดสอบที (t-test)\r\nการวิเคราะห์ความแปรปรวน (ANOVA)', 'สิ่งที่ต้องประเมิน\r\nความพึงพอใจ\r\nวิธีการประเมิน\r\nแบบประเมินความพึงพอใจ', 'ผู้เข้าอบรมมีความรู้และความเข้าใจเกี่ยวกับโปรแกรมสำเร็จรูปสำหรับการวิจัยและวัดผลการศึกษา', 'pdf/04.pdf', '0836489705', '2023'),
(5, 'อบรมเชิงปฏิบัติการการใช้โปรแกรม GeoGebra เบื้องต้น', 'images/05.png', '2023-08-27', '1,300', '27-28 ส.ค. 65', 'เพื่อให้ครูคณิตศาสตร์สามารถใช้งานโปรแกรม GeoGebra เบื้องต้นได้\r\nเพื่อบูรณาการกับการเรียนการสอนโดยใช้โปรแกรม GeoGebra เป็นสื่อการเรียนการสอน', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nครูคณิตศาสตร์ (ระดับมัธยมศึกษา) ตามบันทึกข้อตกลงความร่วมมือทางวิชาการ จำนวน 30 คน ต่อรุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการส่งเสริมให้ครูมีความรู้ความเข้าใจในการใช้งานโปรแกรม GeoGebra เบื้องต้น และสามารถสร้างสื่อการเรียนการสอนทางคณิตศาสตร์ด้วยโปรแกรม GeoGebra ได้', 'ความรู้เกี่ยวกับการใช้งานโปรแกรม GeoGebra สำหรับครูคณิตศาสตร์\r\nการสร้างสื่อการสอนทางคณิตศาสตร์ด้วยโปรแกรม GeoGebra', 'สิ่งที่ต้องประเมิน\r\nความพึงพอใจ\r\nวิธีการประเมิน\r\nแบบประเมินความพึงพอใจ', 'ครูมีความรู้ความเข้าใจในการใช้งานโปรแกรม GeoGebra เบื้องต้น และสามารถสร้างสื่อการเรียนการสอนทางคณิตศาสตร์ด้วยโปรแกรม GeoGebra ได้', 'pdf/05.pdf', '0998564770', '2023'),
(6, 'อบรมเชิงปฏิบัติการการจัดทำการทดลองทางฟิสิกส์ตามหนังสือเรียน สสวท. สำหรับครูฟิสิกส์', 'images/06.png', '2023-08-06', '1,000 ', ' 6-7 ส.ค. 65', 'เพื่อส่งเสริมให้ครูผู้สอนฟิสิกส์ มีความรู้ ความเข้าใจ และมีประสบการณ์ในการจัดทำการทดลองทางฟิสิกส์ตามหนังสือเรียน สสวท.', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nครูผู้สอนรายวิชาฟิสิกส์ในระดับมัธยมปลาย จำนวน 30 คน/รุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการส่งเสริมให้ครูผู้สอนฟิสิกส์ มีความรู้ ความเข้าใจ และมีประสบการณ์ในการจัดทำการทดลองทางฟิสิกส์ตามหนังสือเรียน สสวท.', 'การทดลองทางฟิสิกส์ตามหนังสือเรียน สสวท. ในระดับชั้นมัธยมศึกษาตอนปลาย ', 'สิ่งที่ต้องประเมิน\r\nคะแนนการประเมินตนเองในการจัดทำการทดลองทางฟิสิกส์ตามหนังสือเรียน สสวท. และมีคะแนนประเมินอยู่ในระดับมาก\r\nวิธีการประเมิน\r\nแบบประเมินตนเอง', 'ครูผู้สอนฟิสิกส์ที่เข้ารับการอบรม มีความรู้ ความเข้าใจ และได้รับประสบการณ์ในการจัดทำการทดลองทางฟิสิกส์ตามหนังสือเรียน สสวท.\r\nครูผู้สอนฟิสิกส์สามารถนำความรู้ที่ได้รับจากการอบรมไปใช้ในการจัดการเรียนการสอนในระดับมัธยมศึกษาตอนปลายได้', 'pdf/06.pdf', '0884963101', '2023'),
(7, 'อบรมเชิงปฏิบัติการการผลิตแก้วสีเพื่อพัฒนาเป็นอัญมณีสังเคราะห์', 'images/07.png', '2023-08-20', '2,000 ', '20-21 ส.ค. 65', 'เพื่อฝึกทักษะการเตรียมแก้วสีเพื่อพัฒนาเป็นอัญมณีสังเคราะห์', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nกลุ่มบุคคลที่มีความสนใจด้านการฝึกอาชีพ จำนวน 20 คน/รุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการส่งเสริมการฝึกทักษะการเตรียมแก้วสีเพื่อพัฒนาเป็นอัญมณีสังเคราะห์', 'หลักการออกแบบสูตรแก้ว\r\nการคำนวณวัตถุดิบ\r\nการฝึกเตรียมแก้วสี', 'สิ่งที่ต้องประเมิน\r\nทักษะในการเตรียมแก้วสีได้ถูกต้องตามหลักวิชาการ\r\nการออกแบบสูตรแก้ว\r\nวิธีการประเมิน\r\nสังเกตพฤติกรรม\r\nผลงานของผู้ที่เข้าอบรม', 'ผู้เข้าร่วมอบรมมีความรู้ ความเข้าใจ ในการออกแบบสูตรแก้วสีได้ด้วยตนเอง\r\nผู้เข้าร่วมอบรมมีทักษะในการเตรียมแก้วสีได้ถูกต้องตามหลักวิชาการ', 'pdf/07.pdf', '0648945670', '2023'),
(8, 'หลักเกณฑ์และวิธีปฏิบัติที่ดีในการผลิตอาหารและความปลอดภัยอาหาร', 'images/08.png', '2023-08-20', '1,600', '20-21 ส.ค. 65', 'เพื่อให้ผู้ประกอบการอาหารหรือผู้ผลิตอาหารสามารถนำความรู้ของระบบ GMP และ GHP ไปใช้เป็นหลักเกณฑ์และวิธีการที่ดีในการผลิตอาหารเพื่อสร้างความปลอดภัยให้กับผู้บริโภค\r\nเพื่อให้ผู้ประกอบการอาหารหรือผู้ผลิตอาหารสามารถนำความรู้เกี่ยวกับสารก่อภูมิแพ้ในอาหาร (Food allergen) และวัตถุเจือปนอาหาร (Food additive) ไปปรับใช้ในกระบวนการผลิตอาหารได้อย่างปลอดภัยต่อผู้บริโภ\r\n', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nผู้ประกอบการอาหารหรือผู้ผลิตอาหารและบุคคลทั่วไปที่สนใจ จำนวน 20 คน/รุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการสร้างเสริมให้ผู้ประกอบการอาหารหรือผู้ผลิตอาหารสามารถนำความรู้ของระบบ GMP และGHP ไปใช้เป็นหลักเกณฑ์และวิธีการที่ดีในการผลิตอาหารเพื่อสร้างความปลอดภัยให้กับผู้บริโภค และนำความรู้เกี่ยวกับสารก่อภูมิแพ้ในอาหาร (Food allergen) และวัตถุเจือปนอาหาร (Food additive) ไปปรับใช้ในกระบวนการผล', 'ความรู้เกี่ยวกับข้อกำหนดของ GMP/GHP ตามมาตรฐาน CODEX\r\nความรู้เกี่ยวกับชนิดของอาหารที่ก่อภูมิแพ้ ข้อความที่ต้องติดฉลาก food allergen และการประเมินความเสี่ยงด้าน food allergen ในวัตถุดิบ\r\nความรู้เกี่ยวกับการแบ่งกลุ่มวัตถุเจือปนอาหาร กฎระเบียบที่เกี่ยวข้องกับวัตถุเจือปนอาหาร เงื่อนไขการใช้และอันตรายจากการใช้วัตถุเจือปนในอาหารไม่ถูกต้อง และประโยชน์ในการใช้วัตถุเจือปนอาหาร', 'สิ่งที่ต้องประเมิน\r\nผู้ประกอบการอาหารหรือผู้ผลิตอาหารสอบผ่านเกณฑ์ไม่น้อยกว่าร้อยละ 70\r\nวิธีการประเมิน\r\nแบบประเมินตนเอง', 'ผู้ประกอบการอาหารหรือผู้ผลิตอาหารสามารถนำความรู้ของระบบ GMP และ GHP ไปใช้เป็นหลักเกณฑ์และวิธีการที่ดีในการผลิตอาหารเพื่อสร้างความปลอดภัยให้กับผู้บริโภคได้\r\nผู้ประกอบการอาหารหรือผู้ผลิตอาหารสามารถนำความรู้เกี่ยวกับสารก่อภูมิแพ้ในอาหาร (Food allergen) และวัตถุเจือปนอาหาร (Food additive) ไปปรับใช้ในกระบวนการผลิตอาหารได้อย่างปลอดภัยต่อผู้บริโภคได้', 'pdf/08.pdf', '0874598603', '2023'),
(9, 'อบรมเชิงปฏิบัติการการส่งเสริมสุขภาพในชุมชน สำหรับนักส่งเสริมสุขภาพ และประชาชนทั่วไป', 'images/09.png', '2023-08-25', '1,300', '25-26 ส.ค. 65', 'เพื่อส่งเสริมให้นักส่งเสริมสุขภาพ และประชาชนทั่วไปมีความรู้ในเรื่องชุมชน และการส่งเสริมสุขภาพในชุมชน\r\nเพื่อส่งเสริมให้นักส่งเสริมสุขภาพ และประชาชนทั่วไปมีทักษะในการประยุกต์ใช้องค์ความรู้ด้านสุขภาพในการส่งเสริมสุขภาพในชุมชน', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nนักส่งเสริมสุขภาพ และประชาชนทั่วไป 40 คน ต่อรุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการส่งเสริมองค์ความรู้ และทักษะในการส่งเสริมสุขภาพในชุมชน', 'แนวคิด ทฤษฎีเกี่ยวกับชุมชน  และการส่งเสริมสุขภาพ  รวมไปถึงทักษะการประยุกต์ใช้องค์ความรู้ในการส่งเสริมสุขภาพในชุมชน ที่สอดคล้องกับสถานการณ์สุขภาพในสังคมปัจจุบัน', 'สิ่งที่ต้องประเมิน\r\nคะแนนทดสอบหลังการอบรม\r\nวิธีการประเมิน\r\nแบบทดสอบหลังการอบรม', 'นักส่งเสริมสุขภาพ และประชาชนทั่วไปมีความรู้ และทักษะในการส่งเสริมสุขภาพในชุมชน\r\nนักส่งเสริมสุขภาพ และประชาชนทั่วไปนำความรู้และทักษะที่ได้เพื่อการดูแลสุขภาพในชุมชนที่รับผิดชอบต่อไป', 'pdf/09.pdf', '0988750201', '2023'),
(10, 'อบรมเชิงปฏิบัติการการจัดตกแต่งและออกแบบอาหารเพื่อเพิ่มมูลค่า', 'images/10.png', '2023-07-30', '2,900 ', '30-31 ก.ค. 65', 'เพื่อให้ผู้เข้าอบรมมีทักษะด้านการจัดตกแต่งและออกแบบอาหาร มีความรู้ด้านการปรับเปลี่ยนภาพลักษณ์อาหารเพื่อเพิ่มมูลค่า\r\nเพื่อเพิ่มความรู้และความเข้าใจในเลือกภาชนะและองค์ประกอบฉากในการถ่ายภาพอาหารเบื้องต้น', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nบุคคลทั่วไป ผู้ประกอบการธุรกิจอาหารและเครื่องดื่ม และผู้สนใจ จำนวน 15 คน/รุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการสร้างเสริมทักษะด้านการจัดตกแต่งและออกแบบอาหาร มีความรู้ด้านการปรับเปลี่ยนภาพลักษณ์อาหารเพื่อเพิ่มมูลค่า', 'ความรู้เกี่ยวกับ Food stylist และ Food Presentation\r\nการใช้ศิลปะพื้นฐานและองค์ประกอบศิลป์ในการจัดตกแต่งอาหาร\r\nการเลือกภาชนะและการจัดจานอาหารให้เหมาะสมกับธุรกิจอาหารและเครื่องดื่ม\r\nเทคนิคการถ่ายภาพอาหาร และมุมมองการถ่ายภาพอาหารเบื้องต้น', 'สิ่งที่ต้องประเมิน\r\nความพึงพอใจหลังเข้าร่วมกิจกรรม โดยมีความพึงพอใจมากกว่าร้อยละ 70\r\nวิธีการประเมิน\r\nแบบประเมินความพึงพอใจ', 'ผู้เข้าอบรมมีความรู้และเข้าใจ สามารถจัดตกแต่งและออกแบบอาหารเพื่อเพิ่มมูลค่าได้\r\nผู้เข้าอบรมสามารถจัดอาหารเพื่อการถ่ายภาพได้ มีผลงานจากการจัดอาหารที่เข้าร่วมอบรม', 'pdf/10.pdf', '0647852384', '2022'),
(11, 'อบรมเชิงปฏิบัติการการผลิตชีวภัณฑ์และการผลิตปุ๋ยหมักและน้ำหมักชีวภาพเพื่อใช้ประโยชน์ทางการเกษตร', 'images/11.png', '2023-07-23', '2,000 ', '23-24 ก.ค. 65', 'เพื่อให้ความรู้และฝึกทักษะในการผลิตชีวภัณฑ์ในการป้องกันและกำจัดศัตรูพืช\r\nเพื่อให้ความรู้และฝึกทักษะในการผลิตปุ๋ยหมักและน้าหมักชีวภาพจากเศษวัสดุ', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nประชาชนที่สนใจ จำนวน 30 คน ต่อรุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการส่งเสริมการผลิตชีวภัณฑ์ในการป้องกันและกำจัดศัตรูพืช และการปุ๋ยหมักและน้ำหมักชีวภาพจากเศษวัสดุ', 'ความรู้เกี่ยวกับชีวภัณฑ์ในการป้องกันและกำจัดศัตรูพืช\r\nขั้นตอนในการผลิตชีวภัณฑ์ในการป้องกันและกำจัดศัตรูพืช\r\nความรู้เกี่ยวกับปุ๋ยหมักและน้ำหมักชีวภาพจากเศษวัสดุ\r\nขั้นตอนในการผลิตปุ๋ยหมักและน้ำหมักชีวภาพจากเศษวัสดุ', 'สิ่งที่ต้องประเมิน\r\nความพึงพอใจ\r\nวิธีการประเมิน\r\nแบบประเมินความพึงพอใจ', 'ผู้เข้าอบรมมีความรู้และความสามารถเกี่ยวกับชีวภัณฑ์ในการป้องกันและกำจัดศัตรูพืช\r\nผู้เข้าอบรมมีความรู้และความสามารถเกี่ยวกับปุ๋ยหมักและน้ำหมักชีวภาพจากเศษวัสดุ', 'pdf/11.pdf', '0657195806', '2022'),
(12, 'อบรมเชิงปฏิบัติการ การผลิตปุ๋ยมูลไส้เดือนดินเพื่อกำจัดขยะอินทรีย์และเพื่อการค้า', 'images/12.png', '2023-07-30', '1,990 ', '30-31 ก.ค. 65', 'เพื่อการถ่ายทอดเทคโนโลยีการเลี้ยงไส้เดือนดินเพื่อการกำจัดขยะอินทรีย์และผลิตปุ๋ยมูลไส้เดือนดิน\r\nเพื่อส่งเสริมอาชีพและการใช้ปุ๋ยอินทรีย์เพื่อการผลิตพืชปลอดภัย', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nครูกลุ่มการงาน /บุคคลทั่วไปที่สนใจ จำนวน 30 คน ต่อรุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการถ่ายทอดเทคโนโลยีการเลี้ยงไส้เดือนดินเพื่อการกำจัดขยะอินทรีย์และผลิตปุ๋ยมูลไส้เดือนดิน', 'ความรู้เกี่ยวกับสายพันธุ์ไส้เดือนดินที่นิยมเลี้ยงในประเทศไทย\r\nรูปแบบและการเลี้ยงไส้เดือนดินเพื่อการผลิตปุ๋ยมูลไส้เดือน\r\nการแปรรูปผลิตภัณฑ์จากมูลไส้เดือนดิน', 'สิ่งที่ต้องประเมิน\r\nผู้เข้าร่วมอบรมสามารถนำความรู้ที่ได้ไปถ่ายทอดหรือนำไปประกอบอาชีพ\r\nวิธีการประเมิน\r\nแบบประเมินตนเอง', 'ผู้เข้าอบรมมีความรู้ ความเข้าใจ และได้รับประสบการณ์ในการเลี้ยงไส้เดือนดิน\r\nผู้เข้าอบรมสามารถนำความรู้ที่ได้รับจากการอบรมไปถ่ายทอดหรือนำไปประกอบอาชีพได้', 'pdf/12.pdf', '0997436809', '2022'),
(13, 'การถักแก้วเพื่อพัฒนาเป็นสินค้าที่ระลึก', 'images/13.png', '2023-07-09', '2,000 ', '9-10 ก.ค. 65', 'เพื่อฝึกทักษะการถักแก้วเพื่อพัฒนาเป็นสินค้าที่ระลึก', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nกลุ่มบุคคลที่มีความสนใจด้านการฝึกอาชีพ จำนวน 20 คน/รุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการส่งเสริมการฝึกทักษะการถักแก้วเพื่อพัฒนาเป็นสินค้าที่ระลึก', 'ฝึกทักษะการถักแก้ว\r\nการออกแบบผลิตภัณฑ์จากแก้วถัก', 'สิ่งที่ต้องประเมิน\r\nทักษะในการถักแก้วขั้นพื้นฐานที่ถูกต้องตามหลักความปลอดภัย\r\nวิธีการประเมิน\r\nสังเกตพฤติกรรม\r\nผลงานของผู้ที่เข้าอบรม', 'ผู้เข้าร่วมอบรมมีทักษะการถักแก้วขั้นพื้นฐานที่ถูกต้องตามหลักความปลอดภัย\r\nผู้เข้าร่วมอบรมสามารถพัฒนาผลิตภัณฑ์แก้วถักได้ด้วยตนเอง', 'pdf/13.pdf', '0668921570', '2022'),
(14, 'อบรมเชิงปฏิบัติการการผลิตแก้วจากขี้เถ้าแกลบ', 'images/14.png', '2023-07-30', '2,000 ', '30-31 ก.ค. 65', 'เพื่อฝึกทักษะการเตรียมแก้วจากขี้เถ้าแกลบ', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nกลุ่มบุคคลที่มีความสนใจด้านการฝึกอาชีพ จำนวน 20 คน/รุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการส่งเสริมการฝึกทักษะการเตรียมแก้วจากขี้เถ้าแกลบ', 'หลักการออกแบบสูตรแก้ว\r\nการคำนวณวัตถุดิบ\r\nการฝึกเตรียมแก้วจากขี้เถ้าแกลบ', 'สิ่งที่ต้องประเมิน\r\nทักษะในการเตรียมแก้วจากขี้เถ้าแกลบได้ถูกต้องตามหลักวิชาการ\r\nวิธีการประเมิน\r\nสังเกตพฤติกรรม\r\nผลงานของผู้ที่เข้าอบรม', 'ผู้เข้าร่วมอบรมมีความรู้ ความเข้าใจ ในการออกแบบสูตรแก้วจากขี้เถ้าแกลบได้ด้วยตนเอง\r\nผู้เข้าร่วมอบรมมีทักษะในการเตรียมแก้วจากขี้เถ้าแกลบได้ถูกต้องตามหลักวิชาการ', 'pdf/14.pdf', '0884368799', '2022'),
(15, 'อบรมเชิงปฏิบัติการการวิเคราะห์วัสดุด้วยเครื่องมือวิทยาศาสตร์', 'images/15.png', '2023-07-23', '2,000 ', '23-24 ก.ค. 65', 'เพื่อฝึกทักษะการวิเคราะห์วัสดุด้วยเครื่องมือวิทยาศาสตร์', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณ\r\nกลุ่มบุคคลที่มีความสนใจด้านการฝึกอาชีพ จำนวน 20 คน/รุ่น\r\nเป้าหมายเชิงคุณภาพ\r\nเป็นการส่งเสริมฝึกทักษะการวิเคราะห์วัสดุด้วยเครื่องมือวิทยาศาสตร์', 'การวิเคราะห์ความหนาแน่นโดยเครื่อง Density Hydrometer\r\nการวิเคราะห์ค่าดัชนีหักเหแสงโดยเครื่องวัดการหักแสง Abbe Digital Refractometer\r\nการวิเคราะห์การดูดกลืนและการส่งผ่านแสงด้วยเครื่อง UV-VIS-NIR Spectrophotometer\r\nการวิเคราะห์องค์ประกอบทางเคมีด้วยเครื่องเอ็กซ์เรย์ฟลูออเรสเซ็นต์ (XRF)', 'สิ่งที่ต้องประเมิน\r\nทักษะการวิเคราะห์วัสดุด้วยเครื่องมือวิทยาศาสตร์\r\nวิธีการประเมิน\r\nสังเกตพฤติกรรม\r\nผลการวิเคราะห์ของผู้ที่เข้าอบรม', 'ผู้เข้าร่วมอบรมมีความรู้ ความเข้าใจ ในการเลือกใช้เครื่องมือวิทยาศาสตร์ในการวิเคราะห์วัสดุได้ด้วยตนเอง\r\nผู้เข้าร่วมอบรมมีทักษะในการวิเคราะห์วัสดุด้วยเครื่องมือวิทยาศาสตร์ได้ถูกต้องตามหลักวิชาการ', 'pdf/15.pdf', '0988566549', '2022'),
(16, 'อบรมเชิงปฏิบัติการทฤษฎีการเกิดแก้วและการประยุกต์ใช้', 'images/16.png', '2023-08-27', '1000 ', '27-28 ส.ค. 65', 'เพื่อถ่ายทอดองค์ความรู้เกี่ยวกับทฤษฎีการเกิดแก้วและการประยุกต์ใช้', '8ชั่วโมง', 'มหาวิทยาลัยราชภัฏนครปฐม', 'เป้าหมายเชิงปริมาณนักเรียน จำนวน 60 คน/รุ่นเป้าหมายเชิงคุณภาพนักเรียนมีความรู้เกี่ยวกับทฤษฎีการเกิดแก้วและการประยุกต์ใช้', 'หลักการการเกิดแก้วสมบัติต่าง ๆ ของวัสดุแก้วหลักการออกแบบสูตรแก้วการคำนวณสารในการเตรียมแก้ว', 'สิ่งที่ต้องประเมินความรู้เกี่ยวกับทฤษฎีการเกิดแก้วและการประยุกต์ใช้จากแบบทดสอบวิธีการประเมินคะแนนของแบบประเมินของผู้ที่เข้าอบรม', 'ผู้เข้าร่วมอบรมมีความรู้ ความเข้าใจเกี่ยวกับทฤษฎีการเกิดแก้ว และการประยุกต์ใช้งานด้านแก้วผู้เข้าร่วมอบรมสามารออกแบบสูตรแก้ว และคำนวณการเตรียมสารได้ด้วยตนเอง', 'pdf/16.pdf', '0845689705', '2023');

-- --------------------------------------------------------

--
-- Table structure for table `soccer_tb`
--

CREATE TABLE `soccer_tb` (
  `identifier` int(11) NOT NULL,
  `first_name` varchar(10) DEFAULT NULL,
  `last_name` varchar(12) NOT NULL,
  `team` varchar(17) NOT NULL,
  `position` varchar(12) NOT NULL,
  `image` varchar(21) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `soccer_tb`
--

INSERT INTO `soccer_tb` (`identifier`, `first_name`, `last_name`, `team`, `position`, `image`) VALUES
(1001, 'Eric', 'Bailly', 'Manchester United', 'Defender', 'ericbailly.jpg'),
(1003, 'Hector', 'Bellerin', 'Arsenal', 'Defender', 'hectorbellerin.jpg'),
(1006, 'Jonny', 'Evans', 'West Brom', 'Defender', 'jonnyevans.jpg'),
(1007, 'Robert', 'Huth', 'Leicester', 'Defender', 'roberthuth.jpg'),
(1008, 'Aleksandar', 'Kolarov', 'Manchester City', 'Defender', 'aleksandarkolarov.jpg'),
(1009, 'Laurent', 'Koscielny', 'Arsenal', 'Defender', 'laurentkoscielny.jpg'),
(1011, 'Gareth', 'McAuley', 'West Brom', 'Defender', 'garethmcauley.jpg'),
(1012, 'Wes', 'Morgan', 'Leicester', 'Defender', 'wesmorgan.jpg'),
(1014, 'Kyle', 'Walker', 'Tottenham', 'Defender', 'kylewalker.jpg'),
(1015, 'Claudio', 'Bravo', 'Manchester City', 'Goalkeeper', 'claudiobravo.jpg'),
(1016, 'Thibaut', 'Courtois', 'Chelsea', 'Goalkeeper', 'thibautcourtois.jpg'),
(1017, 'David', 'De Gea', 'Manchester United', 'Goalkeeper', 'daviddegea.jpg'),
(1018, 'Hugo', 'Lloris', 'Tottenham', 'Goalkeeper', 'hugolloris.jpg'),
(1021, 'Nacer', 'Chadli', 'West Brom', 'Midfielder 2', 'nacerchadli.jpg'),
(1026, 'Eden', 'Hazard', 'Chelsea', 'Midfielder 1', 'edenhazard.jpg'),
(1027, 'Alex', 'Iwobi', 'Arsenal', 'Midfielder 2', 'alexiwobi.jpg'),
(1029, 'Riyad', 'Mahrez', 'Leicester', 'Midfielder 2', 'riyadmahrez.jpg'),
(1031, 'Juan', 'Mata', 'Manchester United', 'Midfielder 1', 'juanmata.jpg'),
(1032, 'Victor', 'Moses', 'Chelsea', 'Midfielder 2', 'victormoses.jpg'),
(1033, 'Mesut', 'Ozil', 'Arsenal', 'Midfielder 1', 'mesutozil.jpg'),
(1034, 'Paul', 'Pogba', 'Manchester United', 'Midfielder 2', 'paulpogba.jpg'),
(1035, 'Heung-Min', 'Son', 'Tottenham', 'Midfielder 1', 'heung-minson.jpg'),
(1036, 'Raheem', 'Sterling', 'Manchester City', 'Midfielder 2', 'raheemsterling.jpg'),
(1037, 'Victor', 'Wanyama', 'Tottenham', 'Midfielder 1', 'victorwanyama.jpg'),
(1038, 'Daniel', 'Amartey', 'Leicester', 'Midfielder 2', 'danielamartey.jpg'),
(1040, 'David', 'Silva', 'Manchester City', 'Midfielder 1', 'davidsilva.jpg'),
(1041, 'Theo', 'Walcott', 'Arsenal', 'Midfielder 2', 'theowalcott.jpg'),
(1042, 'Sergio', 'Aguero', 'Manchester City', 'Striker', 'sergioaguero.jpg'),
(1043, 'Diego', 'Costa', 'Chelsea', 'Striker', 'diegocosta.jpg'),
(1044, 'Zlatan', 'Ibrahimovic', 'Manchester United', 'Striker', 'zlatanibrahimovic.jpg'),
(1045, 'Kelechi', 'Iheanacho', 'Manchester City', 'Striker', 'kelechiiheanacho.jpg'),
(1047, 'Salomon', 'Rondon', 'West Brom', 'Striker', 'salomonrondon.jpg'),
(1048, 'Alexis', 'Sanchez', 'Arsenal', 'Striker', 'alexissanchez.jpg'),
(1049, 'Islam', 'Slimani', 'Leicester', 'Striker', 'islamslimani.jpg'),
(1101, 'Petr', 'Cech', 'Arsenal', 'Goalkeeper', 'petrcech.jpg'),
(1103, 'Christian', 'Benteke', 'Crystal Palace', 'Striker', 'christianbenteke.jpg'),
(1104, 'Nemanja', 'Matic', 'Chelsea', 'Midfielder 2', 'nemanjamatic.jpg'),
(1201, 'Cesar', 'Azpilicueta', 'Chelsea', 'Defender', 'cesarazpilicueta.jpg'),
(1203, 'Kevin', 'De Bruyne', 'Manchester City', 'Midfielder 2', 'kevindebruyne.jpg'),
(1204, 'Marcus', 'Rashford', 'Manchester United', 'Striker', 'marcusrashford.jpg'),
(1208, 'Christian', 'Eriksen', 'Tottenham', 'Midfielder 2', 'christianeriksen.jpg'),
(1209, 'Harry', 'Kane', 'Tottenham', 'Striker', 'harrykane.jpg'),
(1302, 'Jamie', 'Vardy', 'Leicester', 'Striker', 'jamievardy.jpg'),
(1304, 'Gary', 'Cahill', 'Chelsea', 'Defender', 'garycahill.jpg'),
(1401, 'Dele', 'Alli', 'Tottenham', 'Midfielder 1', 'delealli.jpg'),
(1402, 'Olivier', 'Giroud', 'Arsenal', 'Striker', 'oliviergiroud.jpg'),
(1404, 'Marcos', 'Alonso', 'Chelsea', 'Defender', 'marcosalonso.jpg'),
(1500, 'Yaya', 'Toure', 'Manchester City', 'Midfielder 1', 'yayatoure.jpg'),
(1701, 'Willian', 'Borges', 'Chelsea', 'Midfielder 1', 'willian.jpg'),
(1703, 'Gael', 'Clichy', 'Manchester City', 'Defender', 'gaelclichy.jpg'),
(1704, 'Antonio', 'Valencia', 'Manchester United', 'Defender', 'antoniovalencia.jpg'),
(1705, 'Phil', 'Jones', 'Manchester United', 'Defender', 'philjones.jpg'),
(1706, 'Ander', 'Herrera', 'Manchester United', 'Midfielder 1', 'anderherrera.jpg'),
(1707, 'Matt', 'Phillips', 'West Brom', 'Midfielder 1', 'mattphillips.jpg'),
(1709, 'Joe', 'Allen', 'Stoke', 'Midfielder 1', 'joeallen.jpg'),
(2001, 'Marko', 'Arnautovic', 'Stoke', 'Midfielder 2', 'markoarnautovic.jpg'),
(2002, 'Peter', 'Crouch', 'Stoke', 'Striker', 'petercrouch.jpg'),
(2200, 'Gabriel', 'Jesus', 'Manchester City', 'Striker', 'gabrieljesus.jpg'),
(2201, 'Leroy', 'Sane', 'Manchester City', 'Midfielder 1', 'leroysane.jpg'),
(2202, 'Henrikh', 'Mkhitaryan', 'Manchester United', 'Midfielder 2', 'henrikhmkhitaryan.jpg'),
(2306, 'Kasper', 'Schmeichel', 'Leicester', 'Goalkeeper', 'kasperschmeichel.jpg'),
(2307, 'Erik', 'Pieters', 'Stoke', 'Defender', 'erikpieters.jpg'),
(2308, 'Ryan', 'Shawcross', 'Stoke', 'Defender', 'ryanshawcross.jpg'),
(2310, 'Eric', 'Dier', 'Tottenham', 'Midfielder 2', 'ericdier.jpg'),
(2311, 'Ben', 'Foster', 'West Brom', 'Goalkeeper', 'benfoster.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `user_tb`
--

CREATE TABLE `user_tb` (
  `id` int(11) NOT NULL,
  `username` varchar(20) NOT NULL,
  `upassword` varchar(50) NOT NULL,
  `email` varchar(50) NOT NULL,
  `urole` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user_tb`
--

INSERT INTO `user_tb` (`id`, `username`, `upassword`, `email`, `urole`) VALUES
(1, 'gunktp1', '12345', 'exesport2546188@gmail.com', 'user'),
(2, 'gunktp2', '12345', 'arrliver@gmail.com', 'user'),
(3, 'gunktp4', '12345', 'xx@gamil.com', 'user'),
(4, 'gunktp3', '123456', 'xx@gmail.com', 'user'),
(5, 'gunktp4', '12345', 'xxx@gmail.com', 'user'),
(6, 'gunktp5', '123456', 'xxxx@gmail.com', 'user'),
(7, 'gunktp6', 'gunktp6', 'exesport254618@gamil.com', 'user'),
(8, 'gunktp7', 'gunktp7', 'gunktp7@gmail.com', 'user'),
(9, 'gunktp8', 'gunktp8', 'gunktp8@gmail.com', 'user'),
(10, 'gunktp20', 'gunktp20', 'gunktp20@gmail.com', 'admin'),
(11, 'gunktp201', 'gunktp20', 'gunktp201@gmai.com', 'admin'),
(12, 'gunktp14', 'gunktp14', 'gunktp14@gmail.com', 'user'),
(13, 'gunktp50', 'gunktp50', 'gunktp50@gmail.com', 'admin'),
(14, 'gunktp206', 'gunktp206', 'gunktp206@gmail.com', 'user'),
(15, 'gunktp99', 'gunktp99', 'gunktp99@gmail.com', 'user');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `sci_cs`
--
ALTER TABLE `sci_cs`
  ADD PRIMARY KEY (`cs_id`);

--
-- Indexes for table `soccer_tb`
--
ALTER TABLE `soccer_tb`
  ADD PRIMARY KEY (`identifier`);

--
-- Indexes for table `user_tb`
--
ALTER TABLE `user_tb`
  ADD PRIMARY KEY (`id`,`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `sci_cs`
--
ALTER TABLE `sci_cs`
  MODIFY `cs_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- AUTO_INCREMENT for table `soccer_tb`
--
ALTER TABLE `soccer_tb`
  MODIFY `identifier` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2313;

--
-- AUTO_INCREMENT for table `user_tb`
--
ALTER TABLE `user_tb`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
